config/Documents/КонтрактыПроизводителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>КонтрактыПроизводителей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныПроизводителей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованКем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЦенКонтракта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товар</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодТовара</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусОптовый</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусРозничный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусДополнительный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСУчетомФинСкидкиСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаИтогСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТовараПроизводителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусСО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусТП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусЦОЗакупка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусЦОПродажа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусПереоценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Изменения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзм</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияНадДокументами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийИзменения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Приложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/InformationRegisters/ЦеныПроизводителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПроизводителей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦенаЗакупБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БонусДополнительный</Name>
					<Comment>Фин. скидка (в цене), %</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаСУчетомФинСкидкиСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БонусТП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТовараПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЦенКонтракта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КодТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/Enums/ДействияНадДокументами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ДействияНадДокументами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводНового</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеДаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмТабЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмШапка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмТабИШапка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгрузка</Name>
					<Comment>на аптеку</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Откорректирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоРасценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоУведомление</Name>
					<Comment>Для сообщений об ошибках.</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/Enums/ТипыЦенКонтракта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыЦенКонтракта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЦенаGDP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СипЦена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/Documents/КонтрактыПроизводителей/Ext/ObjectModule.bsl
Процедура ПроверитьНаЗаполнение(Отказ)
	
	Если НачалоПериода = Дата(1,1,1) Тогда
		#Если Клиент Тогда
			Предупреждение("Не указана дата начала акции. Документ не может быть проведен",3);
		#КонецЕсли
		Отказ = Истина;	
	КонецЕсли;
	
	Если КонецПериода = Дата(1,1,1) Тогда
		#Если Клиент Тогда
			Предупреждение("Не указана дата окончании акции. Документ не может быть проведен",3);
		#КонецЕсли
		Отказ = Истина;	
	КонецЕсли;
	
	Если КонецПериода < НачалоПериода Тогда
		#Если Клиент Тогда
			Предупреждение("Неправильно указан период акции. Документ не может быть проведен",3);
		#КонецЕсли
		Отказ = Истина;				
	КонецЕсли;
	
	Если Производитель.Пустая() Тогда
		#Если Клиент Тогда
			Предупреждение("В документе не выбран производитель. Документ не может быть проведен",3);
		#КонецЕсли
		Отказ = Истина;
	// ==>ENT-1275.Коробка.06.02.2019.Проверка заполнения поставщика у производителя 
	Иначе
		
		Если НЕ ЗначениеЗаполнено(Производитель.Поставщик) Тогда
			#Если Клиент Тогда
				Предупреждение("Производитель не привязан к поставщику. Документ не может быть проведен",3);
			#КонецЕсли
			Отказ = Истина;
		КонецЕсли; 
	// <==ENT-1275.Коробка.06.02.2019.Проверка заполнения поставщика у производителя 
		
	КонецЕсли;		
	
	Если НЕ Согласован Тогда
		#Если Клиент Тогда
			Предупреждение("Документ не прошел согласование. Проведение невозможно",3);
		#КонецЕсли
		Отказ = Истина;				
	КонецЕсли;
	
	Если Производитель.КодПоставщикаОриолы = 0 Тогда
		#Если Клиент Тогда
			Предупреждение("Не заполнено поле ""Код поставщика в ПО Ориола"" по производителю """ 
			+ Производитель + """. Проведение невозможно", 3);			
		#КонецЕсли
		Отказ = Истина;		
	КонецЕсли;

	Если ТипЦены.Пустая() Тогда
		#Если Клиент Тогда
			Предупреждение("Не указан тип цены. Проведение невозможно", 3);			
		#КонецЕсли
		Отказ = Истина;			
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Поставщик) Тогда
	
		Если ЗначениеЗаполнено(ДоговорПоставщика) Тогда
		
			Если ДоговорПоставщика.Владелец <> Производитель.Поставщик Тогда
			
				#Если Клиент Тогда
					Предупреждение("Договор поставщика не принадлежит поставщику, указанному в карточке производитетеля!",5);
				#КонецЕсли
				Отказ = Истина
			
			КонецЕсли; 
			
		Иначе
		
			#Если Клиент Тогда
				Предупреждение("Не указан договор поставщика!",5);
			#КонецЕсли	
			Отказ = Истина
		
		КонецЕсли;
		
	Иначе
		
		#Если Клиент Тогда
			Предупреждение("Не указан поставщик!",3);
		#КонецЕсли	
		Отказ = Истина
	
	КонецЕсли; 
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 		
		Если НЕ (РольДоступна("супер_АДМИНИСТРАТОР") или  РольДоступна("ОптовикиПолныеПрава")) Тогда		
			Предупреждение("Нет прав на проведение документа", 3);			
		КонецЕсли; 		
		
		ПроверитьНаЗаполнение(Отказ);	
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого стр из Товар Цикл
		РассчитатьЦеныСУчетомБонусов(стр);	
	КонецЦикла;
	
	Если ЭтоНовый() Тогда
		Изменение = Изменения.Добавить();
		Изменение.Дата = ТекущаяДата();
		Изменение.КомментарийИзменения = "Создан новый документ";
		Изменение.Сотрудник = ПараметрыСеанса.ТекущийСотр;
		Изменение.ТипИзм = Перечисления.ДействияНадДокументами.ВводНового;
		
		ИзменитьДатыДействияПредыдущихКонтрактов();
		
	КонецЕсли;
	
	ЗаписатьДействияВИсториюДокумента(Изменения,РежимЗаписи,ПометкаУдаления);	
	
КонецПроцедуры

Процедура ИзменитьДатыДействияПредыдущихКонтрактов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтрактыПроизводителей.Ссылка
	|ИЗ
	|	Документ.КонтрактыПроизводителей КАК КонтрактыПроизводителей
	|ГДЕ
	|	КонтрактыПроизводителей.Проведен
	|	И КонтрактыПроизводителей.Производитель = &Производитель
	|	И &Дата МЕЖДУ КонтрактыПроизводителей.НачалоПериода И КонтрактыПроизводителей.КонецПериода";
	
	Запрос.УстановитьПараметр("Дата", НачалоПериода);
	Запрос.УстановитьПараметр("Производитель", Производитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.КонецПериода = НачалоПериода - 24*60*60;
		
		Попытка
			Объект.Записать(РежимЗаписиДокумента.Запись);
			Сообщить("Изменена дата окончания действия предыдущего контракта (" + Объект.Ссылка + ")");
		Исключение
			Сообщить("Не удалось изменить дату окончания действия предыдущего контракта (" 
			+ Объект.Ссылка + "). Описание ошибки: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Согласован = Ложь;
	СогласованКем = Справочники.Сотрудники.ПустаяСсылка();
	
КонецПроцедуры

Процедура РассчитатьЦеныСУчетомБонусов(ТекущаяСтрока) Экспорт
	 
	//КредитНота = Окр(ТекущаяСтрока.ЦенаЗакупБезНДС * (ТекущаяСтрока.БонусОптовый+ТекущаяСтрока.БонусСО)/100, 2);
	//sd61960
	//КредитНота = Окр(ТекущаяСтрока.ЦенаЗакупБезНДС * (ТекущаяСтрока.БонусОптовый)/100, 2);
	//ENT-561
	КредитНота = Окр(ТекущаяСтрока.ЦенаЗакупБезНДС * (ТекущаяСтрока.БонусОптовый+ТекущаяСтрока.БонусСО)/100, 2);
	Если ТипЦены = Перечисления.ТипыЦенКонтракта.СипЦена Тогда
	
		ЦенаСУчетомФинСкидкиБезНДС = Окр(ТекущаяСтрока.ЦенаЗакупБезНДС * (100-ТекущаяСтрока.БонусДополнительный)/100 + ТекущаяСтрока.ЦенаЗакупБезНДС * ТекущаяСтрока.БонусТП/100, 2);
		СуммаНДС = Окр(ЦенаСУчетомФинСкидкиБезНДС * ТекущаяСтрока.СтавкаНДС/100, 2);
	    ЦенаСУчетомФинСкидкиСНДС = ТекущаяСтрока.ЦенаЗакупБезНДС;
	    ЦенаИтогСНДС = Макс(ЦенаСУчетомФинСкидкиБезНДС + СуммаНДС - КредитНота,0);

	Иначе
	
		ЦенаСУчетомФинСкидкиБезНДС = Окр(ТекущаяСтрока.ЦенаЗакупБезНДС * (100-ТекущаяСтрока.БонусДополнительный)/100, 2);
		СуммаНДС = Окр(ЦенаСУчетомФинСкидкиБезНДС * ТекущаяСтрока.СтавкаНДС/100, 2);
		ЦенаСУчетомФинСкидкиСНДС = ЦенаСУчетомФинСкидкиБезНДС + СуммаНДС;
	    ЦенаИтогСНДС = Макс(ЦенаСУчетомФинСкидкиСНДС - КредитНота,0);
		
	КонецЕсли;
	
	ТекущаяСтрока.ЦенаСУчетомФинСкидкиСНДС = ЦенаСУчетомФинСкидкиСНДС;
	ТекущаяСтрока.ЦенаИтогСНДС = ЦенаИтогСНДС;
	ТекущаяСтрока.БонусЦОЗакупка =  ТекущаяСтрока.БонусОптовый + (1-ТекущаяСтрока.БонусОптовый / 100) * ТекущаяСтрока.БонусСО; //ENT-460
	
КонецПроцедуры

Процедура РассчитатьЦеныСУчетомБонусовСтарый(ТекущаяСтрока) Экспорт
	 
	ЦенаСУчетомФинСкидкиБезНДС = Окр(ТекущаяСтрока.ЦенаЗакупБезНДС * (100-ТекущаяСтрока.БонусДополнительный)/100, 2);
	КредитНота = Окр(ЦенаСУчетомФинСкидкиБезНДС * ТекущаяСтрока.БонусОптовый/100, 2); 
	СуммаНДС = Окр(ЦенаСУчетомФинСкидкиБезНДС * ТекущаяСтрока.СтавкаНДС/100, 2);	
	ЦенаСУчетомФинСкидкиСНДС = ЦенаСУчетомФинСкидкиБезНДС + СуммаНДС;
	ЦенаИтогСНДС = Макс(ЦенаСУчетомФинСкидкиСНДС - КредитНота, 0);
	
	ТекущаяСтрока.ЦенаСУчетомФинСкидкиСНДС = ЦенаСУчетомФинСкидкиСНДС;
	ТекущаяСтрока.ЦенаИтогСНДС = ЦенаИтогСНДС;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЦеныПроизводителей
	Движения.ЦеныПроизводителей.Записывать = Истина;
	Движения.ЦеныПроизводителей.Очистить();
	Для Каждого ТекСтрокаТовар Из Товар Цикл
		Движение = Движения.ЦеныПроизводителей.Добавить();
		Движение.Период						= НачалоДня(Дата);
		Движение.КодТовара					= ТекСтрокаТовар.КодТовара;
		Движение.ЦенаЗакупБезНДС			= ТекСтрокаТовар.ЦенаЗакупБезНДС;
		Движение.БонусДополнительный		= ТекСтрокаТовар.БонусДополнительный;
		Движение.ЦенаСУчетомФинСкидкиСНДС	= ТекСтрокаТовар.ЦенаСУчетомФинСкидкиСНДС;
		Движение.Кратность					= ТекСтрокаТовар.Кратность;
		Движение.БонусТП					= ТекСтрокаТовар.БонусТП;
		Движение.ДатаДокумента				= Дата;
		Движение.Производитель				= Производитель;
		Движение.ТипЦены					= ТипЦены;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
